app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_tweet
    @tweet = Tweet.find(params[:id])