app/controllers/tweets_controller.rb

  def index
    render json: {status: 200, tweets: Tweet.all}
---
SELECT "tweets".* FROM "tweets"

  def update
    @tweet.update(tweet_params)
---
UPDATE "tweets" SET "content" = $1 WHERE "tweets"."id" = $2  [["content", "Somebody finished the beer and didn't tell me!"], ["id", 3]]

  def destroy
    @tweet.destroy()
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]

  def get_tweet
    @tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]